{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_62321","layers":[{"class_name":"Dense","config":{"units":10,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense186961","trainable":true,"batch_input_shape":[null,6],"dtype":"float32"}},{"class_name":"Dense","config":{"units":10,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense186962","trainable":true}},{"class_name":"Dense","config":{"units":4,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense186963","trainable":true}}]},"keras_version":"tfjs-layers 3.18.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.18.0","convertedBy":null,"weightsManifest":[{"paths":["./drone.weights.bin"],"weights":[{"name":"dense_Dense186961/kernel","shape":[6,10],"dtype":"float32"},{"name":"dense_Dense186961/bias","shape":[10],"dtype":"float32"},{"name":"dense_Dense186962/kernel","shape":[10,10],"dtype":"float32"},{"name":"dense_Dense186962/bias","shape":[10],"dtype":"float32"},{"name":"dense_Dense186963/kernel","shape":[10,4],"dtype":"float32"},{"name":"dense_Dense186963/bias","shape":[4],"dtype":"float32"}]}]}